Tekla Open API Reference for Tekla Structures 2025
Brep.StartPointOffset Property
 Gets or sets the beam's start point offset.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Offset StartPointOffset { get; set; }
Public Property StartPointOffset As Offset
	Get
	Set
Property Value
Type: Offset
See Also
Reference
Brep Class
Tekla.Structures.Model Namespace